README.md
```mermaid
classDiagram
    class Identifiable {
        <<interface>>
        +UUID getId();
    }

    class JPAEntityBase {
    }

    class AuthnIdentity {
        -String foreignUserId
    }

    class Profile {
    }

    class User {
    }

    JPAEntityBase --|> Identifiable
    User          --|> JPAEntityBase
    User          *--> AuthnIdentity
    User          *--> Profile
```
